# NothingToApplyError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..NothingToApplyError Property
BuiltInFailures..::..ViewFailures Class See Also
---
Start and end elevations are the same, nothing to Apply.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NothingToApplyError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NothingToApplyError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NothingToApplyError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace